WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/core/rtw_btcoex.c
	u8 curPollEnable = pcmd[0];
	u8 curPollTime = pcmd[1];
	u8 btInfoReason = pcmd[2];
	u8 btInfoLen = pcmd[3];
	u8 btinfo[BT_INFO_LENGTH];

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0,tx_event_length = 0;
	RTW_HCI_STATUS status = HCI_STATUS_SUCCESS;
	rtw_HCI_event *pEvent;

	DBG_871X("%s\n",__func__);
	DBG_871X("current Poll Enable: %d, currrent Poll Time: %d\n",curPollEnable,curPollTime);
	DBG_871X("BT Info reason: %d, BT Info length: %d\n",btInfoReason,btInfoLen);
	/*DBG_871X("%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x\n"
		,pcmd[4],pcmd[5],pcmd[6],pcmd[7],pcmd[8],pcmd[9],pcmd[10],pcmd[11]);*/

	_rtw_memset(btinfo, 0, BT_INFO_LENGTH);

#if 1
	if(BT_INFO_LENGTH != btInfoLen)
	{
		status = HCI_STATUS_INVALID_HCI_CMD_PARA_VALUE;
		DBG_871X("Error BT Info Length: %d\n",btInfoLen);
		//return _FAIL;
	}
	else
#endif
	{
		if(0x1 == btInfoReason || 0x2 == btInfoReason)
		{
			_rtw_memcpy(btinfo, &pcmd[4], btInfoLen);
			btinfo[0] = btInfoReason;
			rtw_btcoex_btinfo_cmd(padapter,btinfo,btInfoLen);
		}
		else
		{
			DBG_871X("Other BT info reason\n");
		}
	}

	//send complete event to BT
	{

		pEvent = (rtw_HCI_event*)(&localBuf[0]);

		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_INFO_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_INFO_NOTIFY, OGF_EXTENSION);
		len = len + 3;

			// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

			//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;
#if 0
		rtw_btcoex_dump_tx_msg((u8 *)pEvent, tx_event_length,"BT_info_event");
#endif
		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);

		return status;
			//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_BT_patch_ver_info_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	RTW_HCI_STATUS status=HCI_STATUS_SUCCESS;
	u16		btPatchVer=0x0, btHciVer=0x0;
	//u16		*pU2tmp;

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;

	btHciVer = pcmd[0] | pcmd[1]<<8;
	btPatchVer = pcmd[2] | pcmd[3]<<8;


	DBG_871X("%s, cmd:%02x %02x %02x %02x\n",__func__, pcmd[0] ,pcmd[1] ,pcmd[2] ,pcmd[3]);
	DBG_871X("%s, HCI Ver:%d, Patch Ver:%d\n",__func__, btHciVer,btPatchVer);

	rtw_btcoex_SetBtPatchVersion(padapter,btHciVer,btPatchVer);


	//send complete event to BT
	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_PATCH_VERSION_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_PATCH_VERSION_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;
#if 0
		rtw_btcoex_dump_tx_msg((u8 *)pEvent, tx_event_length,"BT_patch_event");
#endif
		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_HCI_Ver_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	RTW_HCI_STATUS status=HCI_STATUS_SUCCESS;
	u16 hciver = pcmd[0] | pcmd[1] <<8;

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;

	struct bt_coex_info *pcoex_info = &padapter->coex_info;
	PBT_MGNT	pBtMgnt=&pcoex_info->BtMgnt;
	pBtMgnt->ExtConfig.HCIExtensionVer = hciver;
	DBG_871X("%s, HCI Version: %d\n",__func__,pBtMgnt->ExtConfig.HCIExtensionVer);
	if(pBtMgnt->ExtConfig.HCIExtensionVer  < 4)
	{
		status = HCI_STATUS_INVALID_HCI_CMD_PARA_VALUE;
		DBG_871X("%s, Version = %d, HCI Version < 4\n",__func__,pBtMgnt->ExtConfig.HCIExtensionVer );
	}
	else
	{
		rtw_btcoex_SetHciVersion(padapter,hciver);
	}
	//send complete event to BT
	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_EXTENSION_VERSION_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_EXTENSION_VERSION_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}

}

u8 rtw_btcoex_parse_WIFI_scan_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	RTW_HCI_STATUS status=HCI_STATUS_SUCCESS;

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;

	struct bt_coex_info *pcoex_info = &padapter->coex_info;
	PBT_MGNT	pBtMgnt=&pcoex_info->BtMgnt;
	pBtMgnt->ExtConfig.bEnableWifiScanNotify= pcmd[0];
	DBG_871X("%s, bEnableWifiScanNotify: %d\n",__func__,pBtMgnt->ExtConfig.bEnableWifiScanNotify);

	//send complete event to BT
	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_ENABLE_WIFI_SCAN_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_ENABLE_WIFI_SCAN_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_HCI_link_status_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;
	struct bt_coex_info	*pcoex_info=&padapter->coex_info;
	PBT_MGNT	pBtMgnt=&pcoex_info->BtMgnt;
	//PBT_DBG		pBtDbg=&padapter->MgntInfo.BtInfo.BtDbg;
	u8		i, numOfHandle=0, numOfAcl=0;
	u16		conHandle;
	u8		btProfile, btCoreSpec, linkRole;
	u8		*pTriple;

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;

	//pBtDbg->dbgHciInfo.hciCmdCntLinkStatusNotify++;
	//RT_DISP_DATA(FIOCTL, IOCTL_BT_HCICMD_EXT, "LinkStatusNotify, Hex Data :\n",
	//		&pHciCmd->Data[0], pHciCmd->Length);

	DBG_871X("BTLinkStatusNotify\n");

	// Current only RTL8723 support this command.
	//pBtMgnt->bSupportProfile = TRUE;
	pBtMgnt->bSupportProfile = _FALSE;

