WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/core/rtw_btcoex.c
	pBtMgnt->ExtConfig.NumberOfACL = 0;
	pBtMgnt->ExtConfig.NumberOfSCO = 0;

	numOfHandle = pcmd[0];
	//RT_DISP(FIOCTL, IOCTL_BT_HCICMD_EXT, ("numOfHandle = 0x%x\n", numOfHandle));
	//RT_DISP(FIOCTL, IOCTL_BT_HCICMD_EXT, ("HCIExtensionVer = %d\n", pBtMgnt->ExtConfig.HCIExtensionVer));
	DBG_871X("numOfHandle = 0x%x\n", numOfHandle);
	DBG_871X("HCIExtensionVer = %d\n", pBtMgnt->ExtConfig.HCIExtensionVer);

	pTriple = &pcmd[1];
	for(i=0; i<numOfHandle; i++)
	{
		if(pBtMgnt->ExtConfig.HCIExtensionVer < 1)
		{
			conHandle = *((u8 *)&pTriple[0]);
			btProfile = pTriple[2];
			btCoreSpec = pTriple[3];
			if(BT_PROFILE_SCO == btProfile)
			{
				pBtMgnt->ExtConfig.NumberOfSCO++;
			}
			else
			{
				pBtMgnt->ExtConfig.NumberOfACL++;
				pBtMgnt->ExtConfig.aclLink[i].ConnectHandle = conHandle;
				pBtMgnt->ExtConfig.aclLink[i].BTProfile = btProfile;
				pBtMgnt->ExtConfig.aclLink[i].BTCoreSpec = btCoreSpec;
			}
			//RT_DISP(FIOCTL, IOCTL_BT_HCICMD_EXT,
			//	("Connection_Handle=0x%x, BTProfile=%d, BTSpec=%d\n",
			//		conHandle, btProfile, btCoreSpec));
			DBG_871X("Connection_Handle=0x%x, BTProfile=%d, BTSpec=%d\n", conHandle, btProfile, btCoreSpec);
			pTriple += 4;
		}
		else if(pBtMgnt->ExtConfig.HCIExtensionVer >= 1)
		{
			conHandle = *((pu2Byte)&pTriple[0]);
			btProfile = pTriple[2];
			btCoreSpec = pTriple[3];
			linkRole = pTriple[4];
			if(BT_PROFILE_SCO == btProfile)
			{
				pBtMgnt->ExtConfig.NumberOfSCO++;
			}
			else
			{
				pBtMgnt->ExtConfig.NumberOfACL++;
				pBtMgnt->ExtConfig.aclLink[i].ConnectHandle = conHandle;
				pBtMgnt->ExtConfig.aclLink[i].BTProfile = btProfile;
				pBtMgnt->ExtConfig.aclLink[i].BTCoreSpec = btCoreSpec;
				pBtMgnt->ExtConfig.aclLink[i].linkRole = linkRole;
			}
			//RT_DISP(FIOCTL, IOCTL_BT_HCICMD_EXT,
			DBG_871X("Connection_Handle=0x%x, BTProfile=%d, BTSpec=%d, LinkRole=%d\n",
				conHandle, btProfile, btCoreSpec, linkRole);
			pTriple += 5;
		}
	}
	rtw_btcoex_StackUpdateProfileInfo();

		//send complete event to BT
	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_LINK_STATUS_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_LINK_STATUS_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}


}

u8 rtw_btcoex_parse_HCI_BT_coex_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_COEX_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_COEX_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_HCI_BT_operation_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	DBG_871X("%s, OP code: %d\n",__func__,pcmd[0]);

	switch(pcmd[0])
	{
		case HCI_BT_OP_NONE:
			DBG_871X("[bt operation] : Operation None!!\n");
			break;
		case HCI_BT_OP_INQUIRY_START:
			DBG_871X("[bt operation] : Inquiry start!!\n");
			break;
		case HCI_BT_OP_INQUIRY_FINISH:
			DBG_871X("[bt operation] : Inquiry finished!!\n");
			break;
		case HCI_BT_OP_PAGING_START:
			DBG_871X("[bt operation] : Paging is started!!\n");
			break;
		case HCI_BT_OP_PAGING_SUCCESS:
			DBG_871X("[bt operation] : Paging complete successfully!!\n");
			break;
		case HCI_BT_OP_PAGING_UNSUCCESS:
			DBG_871X("[bt operation] : Paging complete unsuccessfully!!\n");
			break;
		case HCI_BT_OP_PAIRING_START:
			DBG_871X("[bt operation] : Pairing start!!\n");
			break;
		case HCI_BT_OP_PAIRING_FINISH:
			DBG_871X("[bt operation] : Pairing finished!!\n");
			break;
		case HCI_BT_OP_BT_DEV_ENABLE:
			DBG_871X("[bt operation] : BT Device is enabled!!\n");
			break;
		case HCI_BT_OP_BT_DEV_DISABLE:
			DBG_871X("[bt operation] : BT Device is disabled!!\n");
			break;
		default:
			DBG_871X("[bt operation] : Unknown, error!!\n");
			break;
	}

			//send complete event to BT
	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_OPERATION_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_OPERATION_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_BT_AFH_MAP_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_AFH_MAP_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_AFH_MAP_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

