WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/core/rtw_btcoex.c
		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_BT_register_val_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{

	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_REGISTER_VALUE_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_REGISTER_VALUE_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_HCI_BT_abnormal_notify_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_BT_ABNORMAL_NOTIFY, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_BT_ABNORMAL_NOTIFY, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

u8 rtw_btcoex_parse_HCI_query_RF_status_cmd(_adapter *padapter, u8 *pcmd, u16 cmdlen)
{
	u8 localBuf[6] = "";
	u8 *pRetPar;
	u8	len=0, tx_event_length =0;
	rtw_HCI_event *pEvent;
	RTW_HCI_STATUS	status=HCI_STATUS_SUCCESS;

	{
		pEvent = (rtw_HCI_event *)(&localBuf[0]);


		pEvent->EventCode = HCI_EVENT_COMMAND_COMPLETE;
		pEvent->Data[0] = 0x1;	//packet #
		pEvent->Data[1] = HCIOPCODELOW(HCI_QUERY_RF_STATUS, OGF_EXTENSION);
		pEvent->Data[2] = HCIOPCODEHIGHT(HCI_QUERY_RF_STATUS, OGF_EXTENSION);
		len = len + 3;

		// Return parameters starts from here
		pRetPar = &pEvent->Data[len];
		pRetPar[0] = status;		//status

		len++;
		pEvent->Length = len;

		//total tx event length + EventCode length + sizeof(length)
		tx_event_length = pEvent->Length + 2;

		status = rtw_btcoex_sendmsgbysocket(padapter, (u8 *)pEvent, tx_event_length, _FALSE);
		return status;
		//bthci_IndicateEvent(Adapter, PPacketIrpEvent, len+2);
	}
}

/*****************************************
* HCI cmd format :
*| 15 - 0						|
*| OPcode (OCF|OGF<<10)		|
*| 15 - 8		|7 - 0			|
*|Cmd para 	|Cmd para Length	|
*|Cmd para......				|
******************************************/

//bit 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15
//	 |	OCF			             |	   OGF       |
void rtw_btcoex_parse_hci_extend_cmd(_adapter *padapter, u8 *pcmd, u16 len,const u16 hci_OCF)
{

	DBG_871X("%s: OCF: %x\n",__func__,hci_OCF);
	switch(hci_OCF)
	{
		case HCI_EXTENSION_VERSION_NOTIFY:
			DBG_871X("HCI_EXTENSION_VERSION_NOTIFY\n");
			rtw_btcoex_parse_HCI_Ver_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_LINK_STATUS_NOTIFY:
			DBG_871X("HCI_LINK_STATUS_NOTIFY\n");
			rtw_btcoex_parse_HCI_link_status_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_OPERATION_NOTIFY:
			// only for 8723a 2ant
			DBG_871X("HCI_BT_OPERATION_NOTIFY\n");
			rtw_btcoex_parse_HCI_BT_operation_notify_cmd(padapter,pcmd, len);
			//
			break;
		case HCI_ENABLE_WIFI_SCAN_NOTIFY:
			DBG_871X("HCI_ENABLE_WIFI_SCAN_NOTIFY\n");
			rtw_btcoex_parse_WIFI_scan_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_QUERY_RF_STATUS:
			// only for 8723b 2ant
			DBG_871X("HCI_QUERY_RF_STATUS\n");
			rtw_btcoex_parse_HCI_query_RF_status_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_ABNORMAL_NOTIFY:
			DBG_871X("HCI_BT_ABNORMAL_NOTIFY\n");
			rtw_btcoex_parse_HCI_BT_abnormal_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_INFO_NOTIFY:
			DBG_871X("HCI_BT_INFO_NOTIFY\n");
			rtw_btcoex_parse_BT_info_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_COEX_NOTIFY:
			DBG_871X("HCI_BT_COEX_NOTIFY\n");
			rtw_btcoex_parse_HCI_BT_coex_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_PATCH_VERSION_NOTIFY:
			DBG_871X("HCI_BT_PATCH_VERSION_NOTIFY\n");
			rtw_btcoex_parse_BT_patch_ver_info_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_AFH_MAP_NOTIFY:
			DBG_871X("HCI_BT_AFH_MAP_NOTIFY\n");
			rtw_btcoex_parse_BT_AFH_MAP_notify_cmd(padapter,pcmd, len);
			break;
		case HCI_BT_REGISTER_VALUE_NOTIFY:
			DBG_871X("HCI_BT_REGISTER_VALUE_NOTIFY\n");
			rtw_btcoex_parse_BT_register_val_notify_cmd(padapter,pcmd, len);
			break;
		default:
			DBG_871X("ERROR!!! Unknown OCF: %x\n",hci_OCF);
			break;

	}
}

void rtw_btcoex_parse_hci_cmd(_adapter *padapter, u8 *pcmd, u16 len)
{
	u16 opcode = pcmd[0] | pcmd[1]<<8;
	u16 hci_OGF = HCI_OGF(opcode);
	u16 hci_OCF = HCI_OCF(opcode);
	u8 cmdlen = len -3;
	u8 pare_len = pcmd[2];

	DBG_871X("%s\n",__func__);
	DBG_871X("OGF: %x,OCF: %x\n",hci_OGF,hci_OCF);
	switch(hci_OGF)
	{
		case OGF_EXTENSION:
			DBG_871X("HCI_EXTENSION_CMD_OGF\n");
			rtw_btcoex_parse_hci_extend_cmd(padapter, &pcmd[3], cmdlen, hci_OCF);
			break;
		default:
			DBG_871X("Other OGF: %x\n",hci_OGF);
			break;
	}
}

u16 rtw_btcoex_parse_recv_data(u8 *msg, u8 msg_size)
{
	u8 cmp_msg1[32] = attend_ack;
	u8 cmp_msg2[32] = leave_ack;
	u8 cmp_msg3[32] = bt_leave;
	u8 cmp_msg4[32] = invite_req;
	u8 cmp_msg5[32] = attend_req;
	u8 cmp_msg6[32] = invite_rsp;
	u8 res = OTHER;

	if (_rtw_memcmp(cmp_msg1, msg, msg_size) == _TRUE) {
		/*DBG_871X("%s, msg:%s\n",__func__,msg);*/
		res = RX_ATTEND_ACK;
	} else if (_rtw_memcmp(cmp_msg2, msg, msg_size) == _TRUE) {
		/*DBG_871X("%s, msg:%s\n",__func__,msg);*/
		res = RX_LEAVE_ACK;
	} else if (_rtw_memcmp(cmp_msg3, msg, msg_size) == _TRUE) {
		/*DBG_871X("%s, msg:%s\n",__func__,msg);*/
		res = RX_BT_LEAVE;
	} else if (_rtw_memcmp(cmp_msg4, msg, msg_size) == _TRUE) {
		/*DBG_871X("%s, msg:%s\n",__func__,msg);*/
		res = RX_INVITE_REQ;
	} else if (_rtw_memcmp(cmp_msg5, msg, msg_size) == _TRUE) {
		res = RX_ATTEND_REQ;
	} else if (_rtw_memcmp(cmp_msg6, msg, msg_size) == _TRUE) {
		res = RX_INVITE_RSP;
	} else {
		DBG_871X("%s, %s\n", __func__, msg);
		res = OTHER;
	}

	DBG_871X("%s, res:%d\n", __func__, res);

	return res;
}

void rtw_btcoex_recvmsgbysocket(void *data)
{
	u8 recv_data[255];
	u8 tx_msg[255] = leave_ack;
	u32 len = 0;

